#Даны строки S, S1 и S2. Заменить в строке S все вхождения строки S1 на строку S2.
strr='abrakadabra'
s1='abra'
s2='lmao'
a = strr.replace(s1, s2)

print(a)