tourists_data = """
INSERT INTO tourists(name, surname, sex, country, date_of_birthday, phone_number, email) VALUES 
('Иван', 'Иванов', 'М', 'Россия','1990-01-01', '+123456789', 'ivanov@mail.ru'),
('Мария', 'Петрова', 'Ж', 'Латвия','1995-02-02', '+987654321', 'petrova@mail.ru'),
('Петр', 'Сидоров', 'М', 'Эстония','1985-03-03', '+456789123', 'sidorov@mail.ru'),
('Алексей', 'Смирнов', 'М', 'Литва','1992-04-04', '+789123456', 'smirnov@mail.ru'),
('Елена', 'Кузнецова', 'Ж', 'Республика Беларусь','1993-05-05', '+654321987', 'kuznetsova@mail.ru'),
('Дмитрий', 'Иванов', 'М', 'Казахстан','1988-06-06', '+321654987', 'ivanovd@mail.ru'),
('Ольга', 'Петрова', 'Ж', 'Грузия','1996-07-07', '+159753468', 'petrovao@mail.ru'),
('Николай', 'Васильев', 'М', 'Россия','1986-08-08', '+753159846', 'vasilevn@mail.ru'),
('Анна', 'Сидорова', 'Ж', 'Россия','1991-09-09', '+369258147', 'sidorova@mail.ru'),
('Игорь', 'Смирнов', 'М', 'Россия','1987-10-10', '+852147963', 'smirnovi@mail.ru');
"""

tours_data = """
INSERT INTO tour (title, country, city, date_start, date_end, price) VALUES 
('Экскурсия по Кремлю', 'Россия', 'Москва', '2022-05-01', '2022-05-03', 5000.00),
('Отдых на Черном море', 'Россия', 'Сочи', '2022-07-15', '2022-07-22', 15000.00),
('Путешествие по Древней Греции', 'Греция', 'Афины', '2022-09-01', '2022-09-10', 30000.00),
('Сафари в национальном парке', 'Танзания', 'Серенгети', '2022-06-20', '2022-06-27', 45000.00),
('#сказочноебали', 'Индонезия', 'Денпасар', '2022-08-01', '2022-08-10', 20000.00),
('Греция-отдых на море', 'Греция', 'Спарта', '2022-05-15', '2022-05-18', 8000.00),
('Испания-путешествие по городам', 'Испания', 'Мадрид', '2022-07-01', '2022-07-07', 25000.00),
('Круиз по средиземному морю', 'Италия', 'Рим', '2022-09-15', '2022-09-22', 35000.00),
('Отдых на Мальдивах', 'Мальдивы', 'Мале', '2022-06-01', '2022-06-10', 40000.00),
('Путешествие по Японии', 'Япония', 'Токио', '2022-08-15', '2022-08-25', 50000.00);
"""
booking_data = """
INSERT INTO booking (date_of_booking,tourists_count, id_tourist, id_tour) VALUES 
('2022-04-01',5, 1, 1),
('2022-06-23',6, 2, 5),
('2022-08-15',3, 3, 10),
('2022-05-10',7 ,4, 2),
('2022-07-01',8 ,5, 7),
('2022-06-01',2 ,6, 9),
('2022-09-01',2 ,7, 3),
('2022-05-15', 8,8, 6),
('2022-07-15', 78,9, 2),
('2022-08-20',99 ,10, 8);
"""